package by.trainning.simplestapp.maindz6;

public class Main04 {
	public static void main(String[] args) {
		// Дана последовательность действительных чисел а1 а2 ,..., аn . Выяснить, будет
		// ли она возрастающей.
		int[] a = new int[] { 1, 3, 5, 7, 12 };

		for (int i = 0; i < a.length; i++) {
			if (a[i] + 1 > a[i]) {

			}

		}
		System.out.println("возрастающая");

	}

}
